
//задание 1
#include <stdio.h>
#include <locale.h>
void name()
{
	//задание 2

	puts("******************************************\n"
		"*                                         *\n"
		"* тема: Разработка консольного приложения *\n"
		"*                                         *\n"
		"* Выполнил Пожидаев А.А.                  *\n"
		"*                                         *\n"
		"* *****************************************");
}

void date()
{
	//задание 3
	puts("    _       _     _     \n"
		" | |_|   | | |   | | |_|\n"
		" | |_| . | |_| . |_|   |");

}
//задание 4
void main()
{
	puts("Hello world!");
	setlocale(LC_CTYPE, "RUS");
	puts("Моя программа");
	puts("Нажмите Enter для продолжения...");
	getchar();
	puts("Продолжение программы");
	name();
	date();

	//домашняя работа




	puts("                            /|                    \n"
		"                           / |                    \n"
		"                          /  |                    \n"
		"                         /   |                    \n"
		"                        /____|                    \n"
		"                             |                    \n"
		"           \\-----------------|------------/      \n"
		"            \\                            /       \n"
		"             \\                          /        \n"
		"              \\________________________/           ");
}